#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.s3.aws_s3_object.upload_object["assets/me.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "upload_object" {
      ~ etag                          = "2b2da93e77fde721f118a643a8eb6df8" -> "c204f65960214d546031db3e32db62b0"
        id                            = "assets/me.jpg"
        tags                          = {}
      + version_id                    = (known after apply)
        # (22 unchanged attributes hidden)
    }

  # module.s3.aws_s3_object.upload_object["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "upload_object" {
      ~ etag                          = "dc3c93e323c7d436990bd6693c91464c" -> "4cd1980a1057b1a9872794effd7ced99"
        id                            = "index.html"
        tags                          = {}
      + version_id                    = (known after apply)
        # (22 unchanged attributes hidden)
    }

  # module.s3.aws_s3_object.upload_object["styles-DRSA65TI.css"] will be destroyed
  # (because key ["styles-DRSA65TI.css"] is not in for_each map)
  - resource "aws_s3_object" "upload_object" {
      - bucket                        = "aih.dev.br" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "text/css; charset=utf-8" -> null
      - etag                          = "e8f89d87f8530bea878356c7115948a3" -> null
      - force_destroy                 = false -> null
      - id                            = "styles-DRSA65TI.css" -> null
      - key                           = "styles-DRSA65TI.css" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "../website/dist/personal-website/browser/styles-DRSA65TI.css" -> null
      - storage_class                 = "STANDARD" -> null
      - tags_all                      = {
          - "CreatedAt" = "2024-03-16"
          - "Project"   = "AWS com Terraform"
          - "Service"   = "Static Website"
        } -> null
        # (13 unchanged attributes hidden)
    }

  # module.s3.aws_s3_object.upload_object["styles-TNGICDEC.css"] will be created
  + resource "aws_s3_object" "upload_object" {
      + acl                    = (known after apply)
      + bucket                 = "aih.dev.br"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/css; charset=utf-8"
      + etag                   = "9a22512f3d873a0b48bd595abf0491d8"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "styles-TNGICDEC.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../website/dist/personal-website/browser/styles-TNGICDEC.css"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreatedAt" = "2024-03-16"
          + "Project"   = "AWS com Terraform"
          + "Service"   = "Static Website"
        }
      + version_id             = (known after apply)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ fileset-results = [
        # (3 unchanged elements hidden)
        "polyfills-RT5I6R6G.js",
      ~ "styles-DRSA65TI.css" -> "styles-TNGICDEC.css",
    ]
```

</details>

*Pusher: @hiagop22, Action: `pull_request`, Workflow: `Terraform Plan`*